app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)
    if @product.save
---
INSERT INTO "products" ("name", "created_at", "updated_at") VALUES ('Skirt', '2025-05-19 15:16:17.226381', '2025-05-19 15:16:17.226381') RETURNING "id"

  def update
    if @product.update(product_params)
---
UPDATE "products" SET "updated_at" = '2025-05-19 15:15:55.471513' WHERE "products"."id" = 1